{"_id":{"$oid":"59098aea47eaaf1fa3033d9e"},"updatedAt":{"$date":"2017-05-03T14:20:44.905Z"},"createdAt":{"$date":"2017-05-03T07:46:50.380Z"},"title":"Exercice 1","content":"Exercice 1 \nParamètres de connexion =\u003e email : \"viateur.ayegnon@gmail.com\"; password: \"wildviateur\"/ Un fork git est une copie d'un dépôt existant. Le fork permet ainsi de créer un nouveau dépôt identique au dépôt forker. Ceci a l'avantage d’effectuer des modifications sur le nouveau dépôt sans affecter le depot initial du projet. / Une pull request est une méthode pour soumettre une contribution à un projet de developpement open source. c'est le moyen préférer pour soumettre une contribution dans un projet utilisant un système de versionning comme Git. Une pull request se réalise quand un développeur demande que le commit d'un depot externe (fork) soit pris en compte dans le dépôt principal du projet.  Cela permet d’avoir vérifier qu’il n’y ai pas de bug par une autre personne,  avant d’intégrer les modifications dans le projet principal./\nUne branche permet d’ajouter des fonctionnalités au projet sans influencer le projet principale.\nLa branche de trouve dans le dépôt  tandis que le fork est un dépôt distinct du dépôt du projet.","__v":0,"date":"03-05-2017","publishedAt":"03-05-2017","published":false}
{"_id":{"$oid":"5909927e47eaaf1fa3033d9f"},"updatedAt":{"$date":"2017-05-03T13:12:06.290Z"},"createdAt":{"$date":"2017-05-03T08:19:10.030Z"},"title":"La MEAN Stack","content":"MongoDB  =\u003e\nC'est une technologie qui permet d'installer une base de donnée  Not Only SQL.Elle est utiliser du coté back. Elle n'est pas indispensable à ce projet car on peur remplacer la base de donné par une base de donnée SQL.\nExpress JS =\u003eExpress JS  est un frameWork Node.js minimaliste et flexible qui fournit un ensemble de fonctionnalités robuste pour les applications Web et mobiles. Il permet de construie une API pour notre application WEB. Dans le cadre de ce projet  cette technologie est indispensable . Elle est utilisée du coté back et permet d'executer du javascript coté serveur.\nAngular JS=\u003e est un framework de javascript qui permet de créer des composants. Il facilite la mise en place du pattern MVC (Model View Controller), ne pas utiliser Angular Js dans ce projet impliquerait de profondes modifications dans le code. Il est donc indispensable pour notre projet. Il est utilisé du coté front. // \nla MEAN STACK =\u003e regroupe  les trois technologie Mongo DB pour la base de donnée,  Express JS pour relier le front et le back et ainsi construire une API robuste, Angular pour dynamiser la page Web en front   //","__v":0,"date":"03-05-2017"}
{"_id":{"$oid":"5909de278435994106d297f5"},"updatedAt":{"$date":"2017-05-03T13:41:59.129Z"},"createdAt":{"$date":"2017-05-03T13:41:59.129Z"},"__v":0}
{"_id":{"$oid":"5909e33cc89a2145706113d4"},"updatedAt":{"$date":"2017-05-03T14:04:06.307Z"},"createdAt":{"$date":"2017-05-03T14:03:40.993Z"},"title":"kgl","content":"ddd","published":false,"__v":0}
{"_id":{"$oid":"5909eefb6f46fe4fd77dc1f3"},"updatedAt":{"$date":"2017-05-03T14:53:47.538Z"},"createdAt":{"$date":"2017-05-03T14:53:47.538Z"},"title":"dzfz","content":"ffe","published":true,"__v":0}
{"_id":{"$oid":"5909f933f503e0567e3bae10"},"updatedAt":{"$date":"2017-05-03T15:37:23.711Z"},"createdAt":{"$date":"2017-05-03T15:37:23.711Z"},"title":"cgckjkjccj","publishedAt":"13-98-6777","content":"ssss","__v":0}
